---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceCutout
source: html/5e8fa762-d8cc-c114-7745-699c5e81a0da.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceCutout Property

The property labeled "Image" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceCutout { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.